## Exploratory Analysis for all temperature data 2000-2019

### Data sources

location temperature data - 
https://www.ncdc.noaa.gov/cdo-web/search

water temperature data - 
https://coastwatch.glerl.noaa.gov/statistic/statistic.html

### Date

#### Botanical Garden

- DATE - itself
- TOBS - Temperature at time of observation
- TMAX - Maximum Temperature
- TMIN - Minimum Temperature
- AVG - average between the maximum and the minimum daily values
- LOC - Location

#### Ohare Airport

- DATE
- TAVG - Average Temperature
- TMAX - Maximum Temperature
- TMIN - Minimum Temperature
- AVG - average between the maximum and the minimum daily values
- error - TAVG - AVG
- LOC - Location

#### Lake Michigan Temperature

- Year - year observations were taken
- Day - represents the day of the way
- Michigan - the average daily temp of lake michigan (C deg)

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

%matplotlib inline

In [2]:
# botanical gardens temp data

garden = pd.read_csv('data/temp_data/garden_temp_2000_2019.csv')
garden.head()

         DATE  TOBS  TMAX  TMIN   AVG     LOC
0  2000-01-01  37.0  44.0  28.0  36.0  garden
1  2000-01-02  48.0  49.0  32.0  40.5  garden
2  2000-01-03  37.0  62.0  35.0  48.5  garden
3  2000-01-04  29.0  39.0  25.0  32.0  garden
4  2000-01-05  19.0  30.0  14.0  22.0  garden

In [3]:
# ohare airport data

ohare = pd.read_csv('data/temp_data/ohare_temp_2000_2019.csv')
ohare.head()

         DATE  TAVG  TMAX  TMIN   AVG  error    LOC
0  2000-01-01  42.0  48.0  35.0  41.5    0.5  ohare
1  2000-01-02  48.0  60.0  35.0  47.5    0.5  ohare
2  2000-01-03  35.0  38.0  32.0  35.0    0.0  ohare
3  2000-01-04  28.0  33.0  23.0  28.0    0.0  ohare
4  2000-01-05  20.0  26.0  13.0  19.5    0.5  ohare

In [4]:
water = pd.read_csv('data/temp_data/lake_michigan_water_temp_1995_2019.csv')
water.head()

   Year  Day  Michigan
0  1995    1      5.02
1  1995    2      4.95
2  1995    3      0.20
3  1995    4      0.20
4  1995    5      0.20

In [5]:
garden.shape

(7046, 6)

In [6]:
ohare.shape

(7046, 7)

In [7]:
water.shape

(8766, 3)

In [8]:
water.isnull().sum()

Year        0
Day         0
Michigan    0
dtype: int64

In [9]:
ohare.dtypes

DATE      object
TAVG     float64
TMAX     float64
TMIN     float64
AVG      float64
error    float64
LOC       object
dtype: object

In [10]:
garden.dtypes

DATE     object
TOBS    float64
TMAX    float64
TMIN    float64
AVG     float64
LOC      object
dtype: object

In [11]:
water.dtypes

Year          int64
Day           int64
Michigan    float64
dtype: object

In [12]:
garden.DATE = pd.to_datetime(garden.DATE)

In [13]:
garden.head()

        DATE  TOBS  TMAX  TMIN   AVG     LOC
0 2000-01-01  37.0  44.0  28.0  36.0  garden
1 2000-01-02  48.0  49.0  32.0  40.5  garden
2 2000-01-03  37.0  62.0  35.0  48.5  garden
3 2000-01-04  29.0  39.0  25.0  32.0  garden
4 2000-01-05  19.0  30.0  14.0  22.0  garden

In [14]:
ohare.DATE = pd.to_datetime(ohare.DATE)

In [17]:
garden.set_index(keys='DATE', inplace=True)

In [19]:
ohare.set_index(keys='DATE', inplace=True)

In [23]:
garden.head()

            TOBS  TMAX  TMIN   AVG     LOC
DATE
2000-01-01  37.0  44.0  28.0  36.0  garden
2000-01-02  48.0  49.0  32.0  40.5  garden
2000-01-03  37.0  62.0  35.0  48.5  garden
2000-01-04  29.0  39.0  25.0  32.0  garden
2000-01-05  19.0  30.0  14.0  22.0  garden

In [24]:
ohare.head()

            TAVG  TMAX  TMIN   AVG  error    LOC
DATE
2000-01-01  42.0  48.0  35.0  41.5    0.5  ohare
2000-01-02  48.0  60.0  35.0  47.5    0.5  ohare
2000-01-03  35.0  38.0  32.0  35.0    0.0  ohare
2000-01-04  28.0  33.0  23.0  28.0    0.0  ohare
2000-01-05  20.0  26.0  13.0  19.5    0.5  ohare

In [26]:
df = pd.concat([ohare, garden], axis=1)

In [27]:
df.shape

(7049, 11)

In [28]:
df.head()

,TAVG,TMAX,TMIN,AVG,error,LOC,TOBS,TMAX,TMIN,AVG,LOC
DATE,,,,,,,,,,,
2000-01-01,42.0,48.0,35.0,41.5,0.5,ohare,37.0,44.0,28.0,36.0,garden
2000-01-02,48.0,60.0,35.0,47.5,0.5,ohare,48.0,49.0,32.0,40.5,garden
2000-01-03,35.0,38.0,32.0,35.0,0.0,ohare,37.0,62.0,35.0,48.5,garden
2000-01-04,28.0,33.0,23.0,28.0,0.0,ohare,29.0,39.0,25.0,32.0,garden
2000-01-05,20.0,26.0,13.0,19.5,0.5,ohare,19.0,30.0,14.0,22.0,garden